Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN PSYCHIC STUDIES.tmx
Source language: ko
Languages: en

source: 능력은 점점 쪼개져 사람들에게 물려지게 되었죠.
en: ...and each generation inherited less power than the previous one.

source: *오버 니삭스일 줄은…!!
en: ...was a pair of over-the-knee socks!!!

source: 빨리!!
en: hurry!!!

source: 너도 오후에 보러 와, 강당으로!
en: come to the auditorium this afternoon and watch!

source: 나한테 영력 좀 줘 그럼 쟤들도 볼 수 있어
en: give me some of your spiritual energy. then, they’ll be able to see me.

source: 별것도 아닌 게…
en: those good-for-nothings...

source: 좋아보이냐?
en: does she like him?

source: 어쨌든 우린 보이지도 않고 들리지도 않는데 뭘 도와줘.
en: the rest of us can’t even see it. why should we help?

source: 진짜??
en: really?!

source: 그래도 쟤가 갔으니까 괜찮아
en: he followed her, so it’ll be okay.

source: 미정~!!
en: mijung!!!

source: 너 저번 사건때 봤어
en: I heard about it during the incident last time.

source: 야 내일 도서관 가기로 했는데 평가 좀.
en: hey how does this look for the library tmrw?

source: 저 쓰레기 같은 새끼… 무슨 말로 꼬드기려고 저러는 거야?
en: ugh, that scumbag! is he trying to wheedle her into doing something?!

source: 아이 뭘 또- 됐어, 됐어!
en: naaah! forget it!

source: 덕분에 살았어요!
en: I’m alive because of you!

source: 저기 미래를 볼 수 있는 새끼 하나 있는데,
en: you know that guy over there? he can see the future!

source: 여의주 진짜 능력은 저거지∙∙∙ ∙∙∙ .
en: that’s euijoo’s real super power...

source: 모르는 척하고 있어?
en: got it?

source: 스윽
en: APPEAR

source: 엑…!
en: eh?!

source: 이번에 내가 본 건..
en: what I saw this time...

source: 넌 이제 못 믿는다고
en: I can’t trust you anymore!

source: ∙∙∙ ∙∙∙ 결국 안 받아줬다.
en: I couldn’t turn it in...

source: 너 진주가 찾던데?
en: pearl’s looking for you!

source: 진짜 ㅈ같은 최면 걸기 전에!!
en: unless you want me to hypnotize you to do something real ugly!!!

source: 콰악
en: GRAB

source: 풋
en: PFFT

source: 으아악!!
en: aaagh!

source: 야~!
en: whoa!

source: 그거 아끼는 거 아냐?
en: I thought you really liked them.

source: 너만 하겠냐.
en: it was probably harder for you.

source: 안돼!
en: no!

source: 나는 그러고 있고.
en: I’m already doing so.

source: 작전 성공이다!!
en: the operation’s a success!!!

source: 왜냐하면 진심으로 도와주고 싶었으니까
en: because... I sincerely wanted to help.

source: 무슨 짓을 해도 소용없어…
en: it doesn’t matter what they do...

source: 맞어 딱 그거야!
en: yeah, that’s exactly it!

source: 누구 맘대로?
en: says who?

source: 언제…!
en: when did you-!

source: 어?
en: huh?

source: 아닐걸.
en: wrong.

source: 제발!!
en: please!!!

source: 도와주세요
en: please help me.

source: 슥..
en: LIFT

source: 이미진
en: mijin.

source: 소용없다고.
en: I said it won’t work.

source: 역시 그랬군요~!!
en: I knew it! I was right!!

source: 그동안 너한테 끌려 다녔던 건, 너도 내 소중한 친구여서야.
en: the reason I kept following you is because you’re a valuable friend to me too.

source: 나도 도와주고 싶다니까…
en: I really want to help...

source: 네가 왜…
en: why would you...?

source: 뭘 빠개 지옥을 보고 싶어?
en: why are you laughing? wanna go to hell?

source: 근데 축제 끝나도록 그릴거면 왜 그리고 자빠졌냐?
en: why are you drawing all day, even during the festival?

source: 너무 찬규를 욕하지마~
en: so don’t be so hard on chankyu!

source: 그니까 영력 쎈 사람한테만 보이는 귀신이…
en: so you’re saying a ghost that’s visible only to people with strong spiritual energy...

source: 알아
en: I do.

source: 우리 딸
en: my daughter...

source: 말대꾸?
en: talking back again?

source: 대박!
en: that’s awesome!

source: 그래도 돌려놓으면 끝이야
en: oh well. it doesn’t matter as long as we go back in time.

source: 뭔가 기억이라도 났나 봐?
en: did you remember something?

source: 우리 주말에 도서관 가서 공부하기로 했는데,
en: we’re going to the library to study together this weekend.

source: 퇴각 중
en: during the army’s retreat,

source: 다음 순서는~
en: next up...

source: 앞으로도 나는 네가 계속 진주 곁에…
en: I hope you’ll keep staying by pearl’s side going for...

source: 지금은 더 이상…!
en: we can’t stay any longer-!

source: 알았어 해보자
en: okay, then. let’s try it.

source: 아 맞다, 니 정혜은이랑 사귄다 했나?
en: oh, right! you said you were dating hye-eun jeong.

source: 고생 많았지
en: but it was hard on you, right?

source: 니가 전~등이야?{j}깜빡깜빡하게?
en: is your mind made of slippery slime or something?{j}

source: 어쩌다 사귐?
en: how’d you two meet?

source: 참 지금 이럴 때가 아니라…!
en: wait! that’s not important right now!

source: 아 그러고 보니…
en: oh, come to think of it...

source: 드세요 찬규 님…
en: have this, master chankyu...

source: 이거다…!
en: it’s this...!

source: 제법인데?
en: you’re pretty good.

source: 너 요즘 컨디션 안 좋아 보이더니 이제 괜찮아?
en: you don’t look like you’re in the best conditions recently. are you okay?

source: 아니∙∙∙ 아니다.
en: oh... never mind.

source: 하지만..
en: but...

source: 서울 수복 때 다시 돌아와보니 학교는 다 불타 있었고
en: when we returned after the second battle of seoul, my school had burned to ashes.

source: 정말 괜찮아?
en: are you really okay?

source: 어쩌지…
en: what should I do?

source: 안돼 죽고 싶지 않아
en: no! I don’t want to die!

source: 그러니까 너네 아빠는…
en: so your father...

source: 이 정도 영력이면 나보다 더 강해…!
en: ...his spiritual energy is much stronger than mine!

source: 왠지 여의주가 연애하면 다른 의미로 ㅈ같을 거 같아서
en: if euijoo starts dating, I think that will weirdly feel really sh*tty.

source: 2 수학 사회
en: 2 Math Society

source: 아니… 직접 가져다주는 걸 김우찬이 보면…!!
en: no, wait... if woochan sees me giving them the socks-!!

source: 어…
en: uh...

source: 이 기분은 뭐지..
en: why do I feel...

source: 전등… 하하하…
en: slime... hahaha...

source: 내가 왜 그 생각을 못 했지…??
en: why didn’t I think of it sooner?!

source: 흑!
en: hic!

source: 내 능력은 나와 상대를 함께 과거 시점으로 날려보내는 거야.
en: because my super power is to send myself and another person back in time.

source: 어, 어?
en: h-huh?

source: 어린 척 그만해 이 할망탱아
en: stop acting like a kid, you little granny.

source: 하지만 아빠…
en: but dad...

source: 왜..?
en: why?

source: 동네 정도면 모를까…!!
en: just this neighborhood...

source: 야, 네가 웬일이냐?
en: hey, what’s gotten into you?

source: 쌤통이다…
en: serves him right.

source: 퍽
en: THWACK

source: 뭐 열받는 일이라도 있나 봐?
en: something must be pissing you off, huh?

source: 계획대로
en: according to plan!

source: 역시 귀신은 귀신인가…!
en: is it a ghost after all?

source: 그렇대 우리 친척이 국가 유공자로 인정됐다나…
en: yeah, one of our ancestors was recognized as a national veteran...

source: 7반 같이가자~
en: let’s go to class seven together!

source: 뭐 별수 있나
en: what else can we do?

source: 내 능력을 알든 모르든 사람들은 날 원한다는 거지
en: the fact is, people want me, regardless of whether they know about my super power.

source: 팟
en: PING

source: 팔락
en: FLAP

source: 그럼 그렇게 해줄게
en: okay, then.

source: 비록 중간고사땐 털밀기로 조져버렸지만 기말은 다르다∙∙∙ ∙∙∙ .
en: I had to put my armpit hair on the line for midterms, but finals are a different story...

source: 고마워
en: thanks.

source: 오케 패스 !!
en: uh, skip!!!

source: 평소처럼 나대다간..
en: if I act how I normally do,

source: 이진주 화이팅~!!
en: go, pearl, go!!!

source: 의주야…?
en: euijoo...

source: 그런데 시체도 찾을 수 없었어 단 한 번만이라도 좋으니까,
en: ...but I couldn’t find his corpse. even if I can only get a single glimpse of it...

source: 기말고사
en: finals.

source: 연애 상담
en: dating advice.

source: 야 갑자기 칼로 찌르는 거 아냐?
en: what if she suddenly pulls out a knife?

source: 아니…
en: I mean...

source: 박은혁
en: Eunhyeok Park

source: 이제 됐어?
en: are you satisfied?

source: 아 너..
en: oh, you’re...

source: 어어…?
en: huh?

source: 성불 한다는 거지?
en: you’ll go to heaven, right?

source: 너무 엮이지 마라
en: so don’t get too close too him.

source: 쿠웅
en: DA DUN

source: 고마워…
en: thanks...

source: 우리 중 제일 기가 약해서 넌 최면에 유일하게 걸려
en: you have the weakest energy of us all, so you’d be hypnotized if I did it.

source: 뭔데… 데이트 좀 가자며…
en: what the... you said we should go on a date...

source: 맛있지!!
en: it’s good, right?!

source: 정색
en: SHUT UP

source: 역시 당신은 특별해!
en: you are special!

source: 그럼 태남이는 어때?
en: how about taenam?

source: 걔, 귀신은 못 보는 것 같았고.
en: plus, it seems like he can’t see the ghost.

source: …응…
en: yes...

source: ㅋㅋㅋ
en: lol.

source: 내 주제에 누굴 위한다고…
en: how can I possibly save anyone?

source: 잠까안!!
en: waaait!!!

source: 친구랑 한 약속 까먹었다…
en: I forgot I was supposed to meet her...

source: 고오오
en: DOOM

source: 후후…
en: muahaha...

source: 어어…
en: uh-huh...

source: 왜 나한테만 그래…ㅅ발
en: why are you picking on me only? f*ck...

source: 넌 어차피 아무것도…
en: anyway, nothing will change even if you--

source: 아니 됐고 누가 아까운지 뜨자.
en: whatever. let’s just see who’s really getting the shorter end of the stick,

source: 외면하는 것보다…
en: instead of turning your back on her...

source: '이능력자' 라 불리게 되었어요.
en: are called superhumans.

source: 매점이나 가자~ 언니가 쏜다ㅋㅋ
en: let’s go to the store! it’ll be my treat, hehe!

source: 너, 우리보고 무책임한 이능력자라며.
en: besides, you said we used our powers irresponsibly and selfishly.

source: 핑크색 양말은 누가 잃어버렸나…
en: then who do those pink socks belong to?

source: 어떡하지… 김우찬 이 새끼랑 슬쩍 떨어져서 주인을 찾으려고 했는데…
en: dammit... I was going to sneak away from woochan and find the owner...

source: 요?
en: master.

source: 잠깐 밖에서 이야기해도 괜찮을까?
en: can we go outside for a bit?

source: 책임감도 없는 이능력자들
en: you irresponsible superhumans!

source: 꺄악!
en: ow!!!

source: 내 고민, 진지하게 들어줘서 고마워!
en: thanks for genuinely hearing me out!

source: 오늘 너무 많은 일이 있었…
en: too much happened toda--

source: 환경부요
en: the beautification club.

source: 휙
en: FWIP

source: 스트레스?
en: what is there to be stressed about?

source: 그럴 수만 있다면…!!
en: if I can just find that-!!!

source: 이번엔 불러내는 게 빨랐네
en: you acted pretty quickly this time.

source: 잠깐, 방금 미래가…!
en: wait! I saw the future just now-!

source: !!{j}미, 미안 세진아…!
en: I-I’m s-sorry, sejin!{j}

source: 울 아빤데!!
en: you’re my dad!

source: 외모 같은 건!!
en: my appearance!!!

source: 오 잘됐구만
en: oh, it worked.

source: 아니 난 네가 그동안 하도 귀찮게 굴어서 복수하는 건데??.
en: not me. I’m paying you back for being so annoying recently.

source: ㅂ ㅈ ㄷ ㄱ ㅅ ㅛ ㅕ ㅑ
en: q w e r t y u i

source: 알림마당
en: Announcements

source: 쟤네 뭐야?
en: who was that?

source: 틀렸다… 말이 안 통해…
en: I’m screwed... she isn’t listening at all...

source: 나도 갑자기 감정이 선명하게 느껴져…!
en: I suddenly feel someone’s emotions very clearly!

source: 에라이!!
en: gross!!!

source: 그때 그 섬유 유연제 냄새!
en: it’s the fabric softener!

source: 저거 연애를 해도 될지 어떨지 물어보더니,
en: she asked whether she should date someone.

source: 이 학교애가 크게 다칠지도 몰라!!
en: she might get badly hurt!!!

source: 그게 운명이니까
en: that’s how fate works.

source: 그래… 내가 쟤랑 친한 것도 아니고…
en: oh well... it’s not like I’m close to her or anything...

source: 드디어 찾았구나
en: I finally found you.

source: 전쟁이 멈추고
en: the war ended...

source: 운명 같은 게 어딨어!?
en: fate can’t be real!!!

source: 아니 내 고민은 아니고
en: no, it’s not about my problems this time.

source: 쾅!
en: SLAM

source: 이미진 부른다 진짜?
en: don’t make me call mijin over!

source: 어…?
en: huh?

source: 난 학폭 상담 위주야
en: I usually help with school violence.

source: 나 무슨 부같은 거 든 적 없는데…
en: I never signed up for a club...

source: 넌 연애 모르잖아.
en: you don’t know a thing about dating.

source: 그러니까, 찬규님은 별로 내키지 않아 보이셨지만
en: so, even though you might not be happy with it,

source: 같이 3층 청소 돌아라!
en: then you should go clean the third floor together!

source: 여의주~
en: euijoo!

source: 왜 아무런 책임감도 느끼지 않는 거야?
en: why were there no consequences?

source: 그리고∙∙∙ ∙∙∙ .
en: and...

source: 가족을 두고 죽을지도 모르는데 웃으면서 떠나다니…
en: my dad had left with a smile, even though he might die away from his family.

source: … 무슨 소리야…?
en: what are you talking about?

source: 한번도?
en: not even once?

source: 저쪽인가…?
en: is it coming from there?

source: 미안… 스피커가 무거워서…
en: sorry... the speaker is a bit heavy...

source: 괜찮아?
en: are you okay?

source: 지금 미진이가 잡으려고 한단 거지…?
en: and mijin’s trying to get rid of it?

source: 그러니까…
en: so...

source: 뭐…?
en: what?

source: 너 최면 아니잖아 왜 그렇게까지
en: you’re not hypnotized, so why are you doing that?

source: 의주야.
en: euijoo.

source: 내가 살아온 길 위에
en: on the road that I lived on...

source: 쑥쓰..
en: UHM

source: 내일 급식 메뉴나 알면 그만이지…
en: I’m lucky if I can even find out tomorrow’s lunch menu.

source: 지금도 그 능력들에 의존하느라 헛수고만 하고 있으면서.
en: look at you now. everything you do is in vain because you’re too reliant on those powers.

source: 적당히 버리려고 했는데… 타이밍을 놓쳤다…!
en: I was going to slip these in the trash... but I missed my opportunity!

source: 진주 이번에 전국 대회 출전 결정됐거든
en: pearl is competing in the upcoming national tournament!

source: 아~ 뭐라는 거야 닥쳐
en: ugh... just shut up already.

source: 야 ㅅ발 니 심리 다 보여 개 짓거리하지 마
en: you d*ckhead. I can read all your thoughts. don’t try anything funny!

source: 아오 내가 이럴 줄 알았어
en: I knew it

source: 이미진…?
en: mijin lee?

source: 알지?
en: act like nothing’s wrong!

source: 찬규님은 내거야!
en: master chankyu is mine!

source: 그만큼 미래에 일어날 큰 사건은 잘 바뀌지 않아.
en: so major events that happen in the future aren’t easily changed...

source: 교내 대회 다 끝나지 않았어?
en: but aren’t the intramural tournaments over?

source: 다르다니 뭐가?
en: how?

source: 솔직히 못생겨서 싫다!
en: honestly, I wouldn’t like you because you’re ugly.

source: 왜 쟤랑 사귀냐 김찬규.
en: why are you dating her, chankyu?

source: 너네 아빠가 그렇게 가르치디?
en: is that how your dad taught you?

source: 그거 좋은 생각이군!!
en: that’s a great idea!!

source: 그 귀신은 네 영력이 커서 기생하는 것뿐이야!!
en: that ghost is merely leeching off of your spiritual energy!!!

source: 나는 사고로 죽었다
en: ...I died in an accident.

source: 크읏…!
en: AHHH

source: 남자꾸안꾸룩
en: boys casual fashion

source: 야.
en: hey.

source: 복도에서 못 봤어?
en: didn’t you see her in the hallway?

source: 우찬
en: Woochan

source: 네가 쳐 자놓고 ㅈ랄이야… 깨워줄 친구라도 사귀어 놓던가…
en: you were the one sleeping, you godd*mn moron... don’t you have a friend who could wake you up?

source: 저 자식 이제 분명히…
en: now that jerk’s definitely going to...

source: 나랑 다녀도?
en: walking around with me?

source: 군은 그대로 퇴각하고
en: the army continued retreating...

source: 닥치고 성불이나 당해서
en: so just shut up and go to heaven.

source: 널 위해서 한 말 아니야.
en: I’m not saying this for your benefit!

source: 진짜 드럽게 못그린다 너
en: your drawing really sucks.

source: 너 지금 계약연애인데 뭐해?
en: where are you looking right now?

source: 꼴값….
en: ugh...

source: 귀신아.
en: hey, ghost.

source: ?{j}나랑 같은부잖어.
en: she and I are in the same club,{j}

source: 배신
en: BE

source: 괜찮…겠지…?
en: she should... be okay... right?

source: … 그런 거라면,
en: then...

source: 이렇게 먹어 봐바!!
en: try it like this!

source: 멈칫
en: HALT

source: 기어코!!
en: don’t you dare!!!

source: ㅋㅋ
en: haha.

source: 알겠어!
en: got it!

source: 이러다간 진짜로 성불당한다… 안돼…!!
en: at this rate, she’ll really send me to heaven... nooo!!!

source: 기가 강해졌어 스스로를 받아들인 거지
en: her energy got stronger. she admitted that on her own.

source: 학교에서 상담받으면 전교에 소문난다.
en: peer counseling results in rumors throughout the entire school.

source: 그렇긴 한데…
en: I did, but...

source: 축제…?부활동…?
en: festival? team program?

source: 그게…
en: that’s...

source: 청소?
en: cleaning up?

source: 평소랑 같은데…?
en: everything’s normal.

source: 그래서 저도 긴가민가 했던거예요
en: that’s why I was confused at first.

source: 급식메뉴
en: Lunch Menu

source: 내 자신이 한심해서…
en: because I feel pathetic.

source: 이건…!
en: this is-!

source: 어?{j}어어?
en: h-huh?{j}

source: 할 말 더 있음 나중에 해!
en: let’s talk again later!

source: 박금혁
en: Geumhyeok Park

source: 야 김준영
en: hey, junyoung...

source: 아까도 느꼈지만
en: I felt it earlier too...

source: 과학
en: Science

source: 오히려 진주가 나한테 감사해야 할 상황 아닐까?
en: shouldn’t pearl be grateful?

source: 지금 못하게 하려는 거면 어차피 기회는 또∙∙∙ ∙∙∙
en: if you’re trying to prevent her from doing it again, then--

source: 아 왜 자꾸 범위 늘어요~~~
en: aw, why do you keep adding more?!!!

source: 김우찬한테 들키지 않고 이 양말을 처리해야…!
en: I have to get rid of these socks without letting woochan find out!

source: 내가 싫어!!
en: I don’t want to!

source: 한편
en: meanwhile...

source: 저도 어렴풋이 느끼고는 있었는데 직접 보고 확신했어요
en: it was only a guess, but I’m sure of it now that I’ve seen him.

source: 딸내미 농사 실패라던데?
en: he says his daughter’s an embarrassment.

source: 꼴깞 떤다∙∙∙ ∙∙∙ .
en: yeah right...

source: 미정이 능력은 그런 게∙∙∙ ∙∙∙ .
en: mijung’s super power isn’t...

source: 미정이 덕분에…?
en: thanks to mijung?

source: 참, 너 만화부였지…
en: oh right. you were in the cartoon club.

source: 그리고 그들은 함께 하면 강해져요
en: they become more powerful when they are together.

source: 사람을 이용하려고 들고…
en: but how dare you use people like tools...

source: 근데 갑자기 왜 같이 다니자고 한 거야?
en: why did you suddenly ask to go around together?

source: 다 이야기해줄 테니까 나 좀 도와줘!
en: I’ll tell you everything. can you help me?

source: 괜차나!
en: yup, I’m fine!

source: 속내가 들키면 끝이란걸!!
en: that it’d be the end of him if his thoughts get exposed!!!

source: 뭐야, 너?
en: what’s your problem?

source: 그건 용의 힘이라는 거예요
en: he has the power of a dragon.

source: 반복하고 있다는 게 거짓말은 아닌가 보네.
en: that means you weren’t lying about the repetition.

source: 어린아이 였으니까
en: ...I was a young child.

source: 저 인간한테 최면 썼다가 괜히 TMI 듣고 싶진 않고∙∙∙ ∙∙∙ .
en: but I don’t want to hypnotize him and end up hearing his tmi...

source: 내가 기억하는 것만 열 번은 넘은 것 같네
en: based on my memory, this is at least the tenth time.

source: 아야…
en: ow...

source: 이해간다ㅋㅋ 1학년은 우리가 끝이야?
en: makes sense, haha. then, are we the only first years in the club?

source: 그것도 다 운명인 거죠, 세상에 운명이 아닌 건 없어요, 찬규님~~~!!
en: no, no, no. that’s all fate! everything in the world follows fate, master chankyuuu!!!

source: 응 그렇지?
en: right.

source: 츠… 츠바키 군…?!
en: tzu... tzubaki...?!

source: 어쩌려고…
en: how will they handle it?

source: 나?
en: me?

source: 봄인데 우린 연애도 못하고…
en: it’s spring, but there’s no romance in the air for us...

source: 뭘 본 거야 대체?
en: what in the world did they see?

source: 뭐야, 갑자기 중심축에 힘이…!
en: what the-?! why does my leg...

source: 이 거짓말쟁이야
en: ...you liar!

source: 우리 아가…
en: my baby...

source: 이미진이라고 했냐
en: mijin, right?

source: 빨리요!!
en: hurry!!!

source: 전혀 이상하게 안 보잖아…?
en: she doesn’t think of me strangely at all...?

source: 1화에서 나랑 키스했던 애
en: the kid who kissed me in chapter 1.

source: 으헤헤…
en: buahaha...

source: 음…
en: hmmm...

source: 이 추잡하고 못생긴 악귀야!!
en: you filthy, ugly ghost!!!

source: 좋아 드디어 내 최면이…
en: great! my hypnosis finally...

source: 너구나!!
en: it was you?!

source: 그리고 그건 지금도 변함없어.
en: and I still think the same.

source: 뭐긴, 기말고사 말야, 기말고사.
en: finals, of course. what else would it be?

source: 사실…
en: actually...

source: 여자애들의 발목을 확인 해놓고…!
en: I can check the girls’ ankles...

source: 그렇지만…
en: but--

source: 무슨 짓이야 ㅆ발놈아 내 대사잖아
en: what the f*ck?! that was my line, you prick!

source: 말했지, 이렇게 보는 거 열 번은 넘었다고
en: like I said earlier, we’ve met up like this more than ten times already.

source: 잠깐 화장실
en: the restroom.

source: 잘… 모르겠어…
en: I... don’t know...

source: 스피커 두고 와서 같이 부스 구경할래…?
en: ...like to go around the booths together after you drop off the speaker?

source: 슈우우우
en: BLING

source: 마침 잘 됐네!
en: that’s great!

source: 그래도…
en: but still...

source: 그냥 내가 이상하다는 거 아냐
en: so I’m weird. that’s what you all are saying, right?

source: 아냐, 너의 '연'을 찾는 거지
en: no, I’m looking for your ties.

source: 아, 여기 있었구나?
en: aha, there you are!

source: 태남아…!
en: taenam!

source: 우선은!
en: anyway!

source: 첨 보는데
en: I’ve never seen him before.

source: 어… 좀 갑작스럽지만…
en: uh... it’s kinda sudden...

source: 젠장…!
en: dammit!

source: 제발 부탁이야
en: I beg of you.

source: 5 영
en: 5 Eng

source: 헉!
en: gasp!

source: 애초에 계약연애같은 ㅆ덕스러운 짓을 왜 해!
en: a contract relationship?! why do something so ridiculous?!

source: 어느 일요일에 무너졌다
en: ...came crashing down one sunday.

source: 뭐라든 좀 하게 해 주라.
en: let me do something for you.

source: 아, 아무튼 귀신을 성불 시키지 말아 줘!
en: a-anyway. don’t send the ghost to heaven!

source: 이…이건…
en: this... this is...

source: 노
en: EF

source: 스윽..
en: REACH

source: 야!!
en: dude!

source: 미안해
en: I’m sorry...

source: 하지만 네가 아직 잘 모르는 사실은
en: ...but there’s one thing you don’t know yet.

source: 니들이 여긴 왜 왔냐?
en: why are you guys here?

source: 4 미술 체(육)
en: 4 Art P

source: 와장창
en: SHATTER

source: 걱정 마, 내가 도와준 댔잖아
en: don’t worry. I said I’d help.

source: 야, 이제 저쪽 돌자 나와
en: hey, let’s go clean over there now.

source: 어쨌든 내 몸에 엄청난 영력이 쌓여있다 이거지?
en: so you’re saying my body accumulated tons of spiritual energy, right?

source: 월 화 수
en: M T W

source: 이걸로 몇 번째더라…?
en: how many times has it been?

source: 림2 알
en: ice 2 Not

source: 이것마저 안되면 답이 없어
en: if this doesn’t work, we’re done for.

source: 이겼…!
en: it’s my win-!

source: 그동안 네가 한 번도 이야기하지 않았을 것 같아?
en: you think you wouldn’t have told me the story at least once?

source: 이미진, 맞짱뜨자.
en: mijin, let’s fight.

source: 아무리 능력을 증폭시켜도 기억 못 할 테니까.
en: ...you won’t remember even if you amplify her super power.

source: 이렇게…
en: all while...

source: 뭐?
en: what?

source: 그게 내 눈에는 바보 같았지만, 그래도 난 아빠가 참 좋았다
en: although that seemed foolish to me, I still liked him a lot.

source: 영력을 주면 돼!!
en: give me more!!!

source: 제 각각 떨어져 있으면 보통 능력과 다를 게 없거든요
en: but when they are apart from each other, their powers are no different from ordinary superpowers.

source: 이거
en: through your throat.

source: 용의 힘은 세명이 모이면 막강한 힘이 되지만
en: the dragon’s power becomes incredibly powerful when all three wielders are together.

source: 외모가 문제냐?
en: is my appearance the problem right now?

source: 저 위에 구조물을 피해주면 돼!
en: you need to avoid that object up there!

source: 뭣.
en: what?

source: 슥
en: STARE

source: 아니 설마 남…
en: or maybe he likes boy--

source: 미안 찬규
en: sorry, chankyu.

source: ∙∙∙ ∙∙∙ 찬규 말이 맞아.
en: chankyu’s right...

source: 잠깐… 근데 나 왜 나왔지… 다시 돌아가기 어색하네…
en: wait... why am I out here...? it’d be awkward to go back inside...

source: 하 관둬, 관둬
en: ha... no, forget it.

source: 군번줄조차 받을 수 없었다
en: I couldn’t even get his military id tag.

source: 모르긴, 능력을
en: oh, I know very well.

source: 각자 부활동 부실로 이동해서 회의할 거야
en: each club will have meetings in their rooms.

source: 근데 시체는 어떻게 찾게?
en: but how will you find his body?

source: 사람이∙∙∙ ∙∙∙ .
en: how can...

source: 잘가 쓰레기…!!
en: goodbye, you piece of trash!!

source: 세상이 아무리 어둡고 비극적이어도 말이야
en: ...no matter how dark or tragic the world may be.

source: 그래, 그래봤자 소용 없어.
en: yeah, it won’t work that way.

source: 신아.
en: shin.

source: 무슨 일 있어?
en: what happened?

source: 뭐라도 되겠지!
en: I’m sure it’ll work out somehow.

source: 저, 저건 이제 그냥 잡귀가 아니에요!!
en: th-that’s no longer some random ghost, master!!!

source: 7 영어
en: 7 English

source: 노력은 결코
en: EFFORT NEVER

source: 김찬규 너 요즘 진짜 이상한 거 알아?
en: you’ve been really strange recently, chankyu.

source: 영력…?설마?
en: is that... his spiritual energy?

source: 괜찮아??
en: are you okay?!

source: 과거 이 땅엔 용이 강림한 적이 있어요
en: a dragon once descended onto the earth a long time ago.

source: 너, 그 능력 풀고 하는 게 좋을걸?
en: it’s best if you don’t use that power right now.

source: 그냥 최면으로 어찌어찌 해보려고 했겠지
en: ...I would have tried to fix it somehow by hypnotizing you.

source: 탁탁
en: TAP TAP

source: 쟤 옆반에 이신이라고.
en: shin lee, from the class next door.

source: 그렇다면 답은… 연애를 해보는 것이지
en: then the answer... is to date someone.

source: 운명,이라면…
en: fate...?

source: 알림
en: Notice

source: 나… 정말 처음이라…!!
en: it’s... really my first time-!!

source: 뭐 귀신이니까 하겠거니 했겠지..ㅋ
en: he probably just assumed you could since you’re a ghost, lol.

source: 내가 널 돌려보낸 건 분명 이유가 있었을 거야
en: I’m sure there was a reason why I sent you back here.

source: 어어, 그게 아까…
en: well, earlier...

source: 부상병을 옮기려다 총에 맞았고
en: he was shot while helping an injured comrade.

source: 진주가 화가 너무 많이 나서 대신 왔어.
en: she’s really mad, so I came here instead.

source: 응?
en: hm?

source: 아, 신아 어디…
en: shin! where were...

source: 까똑
en: DING

source: 설마… 이런…
en: resulted... in this...?

source: 어!
en: oh!

source: 겨우 그딴 게 내 자존감 채운 거야…
en: I based all of my self-worth on just that...

source: ㅅㅂ…
en: dammit...

source: 연애 상담은 연애 안 해본 사람이 더 잘해!
en: people who haven’t dated give much better dating advice!

source: 미정이를 위한 계약 연애 후보 찾기!!
en: let’s make a list of candidates to be mijung’s contract boyfriend!!!

source: 넌 네 이야길 잘 안 해서 모르겠단 말야
en: but I don’t know how because you never say much.

source: 꺄아아아아악!!
en: aaaaaack!!!

source: 나도 보여줘!!
en: I wanna see!!!

source: 됐고, 꼴에 차려 입는다고 이상하게 입고 오지만 마라.
en: forget it. just don’t try to dress up or anything.

source: 명탐정 김찬규…!
en: chankyu holmes!

source: 이성적인 건 모르겠지만
en: I don’t know if I’m being rational about this...

source: 네, 네!
en: y-yes, master!

source: 위험하다…!
en: it’s dangerous!

source: 어떻게 해야하지?
en: what am I supposed to do?

source: 용의 힘의 핵심이라고도 할 수 있겠죠
en: you can call it the core of the dragon’s powers.

source: 거기서 나섰으면 안 됐는데.
en: I shouldn’t have stepped up.

source: 그게 왜 나만 기억하고 넌 기억 못 하는지 궁금하지 않아?
en: aren’t you curious why only I remember and you don’t?
